package go_russian_regions

import (
	"testing"
)

var testRegions = []struct {
	In      []string
	OutCode string
}{
	{
		In: []string{
			"Республика Адыгея", "Адыгея Республика", "Адыгея Респ", "Респ Адыгеи", "Республики Адыгеи",
		},
		OutCode: "01",
	},
	{
		In: []string{
			"Республика Алтай", "Алтай Республика", "Алтай Респ", "Респ Алтая", "Алтая", "Алтае",
		},
		OutCode: "04",
	},
	{
		In: []string{
			"Республика Башкортостан", "Башкортостан Респ", "Респ Башкортостан", "Республики Башкортостана",
		},
		OutCode: "02",
	},
	{
		In: []string{
			"Республика Бурятия", "Бурятия Респ", "Респ Бурятия", "Республики Бурятии",
		},
		OutCode: "03",
	},
	{
		In: []string{
			"Республика Дагестан", "Дагестан Респ", "Респ Дагестан", "Республики Дагестана",
		},
		OutCode: "05",
	},
	{
		In: []string{
			"Республика Ингушетия", "Ингушетия Респ", "Респ Ингушетия", "Республики Ингушетии",
		},
		OutCode: "06",
	},
	{
		In: []string{
			"Кабардино-Балкарская республика", "Кабардино-Балкарская Респ", "Респ Кабардино-Балкария", "Кабардино-Балкария",
		},
		OutCode: "07",
	},
	{
		In: []string{
			"Республика Калмыкия", "Калмыкия Респ", "Респ Калмыкия", "Республики Калмыкии",
		},
		OutCode: "08",
	},
	{
		In: []string{
			"Карачаево-Черкесская республика", "Карачаево - Черкесская", "Карачаево- Черкесская", "Карачаево -Черкессия",
		},
		OutCode: "09",
	},
	{
		In: []string{
			"Республика Карелия", "Карелия Респ", "Респ Карелия", "Республики Карелии",
		},
		OutCode: "10",
	},
	{
		In: []string{
			"Республика Коми", "Коми Респ", "Респ Коми", "Республики Коми",
		},
		OutCode: "11",
	},
	{
		In: []string{
			"Республика Крым", "Крым Респ", "Респ Крым", "Респ Крыму",
		},
		OutCode: "91",
	},
	{
		In: []string{
			"Республика Марий Эл", "Республика Марий-Эл", "Марий -Эл", "Марий - Эл",
		},
		OutCode: "12",
	},
	{
		In: []string{
			"Республика Мордовия", "Респ Мордовия", "Мордовия", "республики Мордовии",
		},
		OutCode: "13",
	},
	{
		In: []string{
			"Республика Саха (Якутия)", "Республика Саха(Якутия)", "Республика Саха", "Якутия",
		},
		OutCode: "14",
	},
	{
		In: []string{
			"Республика Северная Осетия - Алания", "Осетия", "Алания", "Осетии", "Алании",
		},
		OutCode: "15",
	},
	{
		In: []string{
			"Республика Татарстан", "Респ Татарстан", "Татария", "республике Татарстане",
		},
		OutCode: "16",
	},
	{
		In: []string{
			"Республика Тыва", "Респ Тыва", "Тыва", "Тыве",
		},
		OutCode: "17",
	},
	{
		In: []string{
			"Удмуртская Республика", "Респ Удмуртия", "Удмуртия", "Удмуртии",
		},
		OutCode: "18",
	},
	{
		In: []string{
			"Республика Хакасия", "Респ Хакасия", "Хакасия", "Хакасии",
		},
		OutCode: "19",
	},
	{
		In: []string{
			"Чеченская Республика", "Респ Чеченская", "Чеченской", "Чечня", "Чечни",
		},
		OutCode: "20",
	},
	{
		In: []string{
			"Чувашская Республика", "Респ Чувашская", "Чувашия", "Чувашии", "Чувашской",
		},
		OutCode: "21",
	},
	{
		In: []string{
			"Алтайский край", "край Алтайский", "Алтайского", "Алтайском",
		},
		OutCode: "22",
	},
	{
		In: []string{
			"Забайкальский край", "край Забайкальский", "Забайкалье", "Забайкальском",
		},
		OutCode: "75",
	},
	{
		In: []string{
			"Камчатский край", "край Камчатский", "Камчатка", "Камчатском",
		},
		OutCode: "41",
	},
	{
		In: []string{
			"Краснодарский край", "край Краснодарский", "Краснодарском",
		},
		OutCode: "23",
	},
	{
		In: []string{
			"Пермский край", "край Пермский", "Пермском",
		},
		OutCode: "59",
	},
	{
		In: []string{
			"Приморский край", "край Приморский", "Приморском",
		},
		OutCode: "25",
	},
	{
		In: []string{
			"Ставропольский край", "край Ставропольский", "Ставрополье",
		},
		OutCode: "26",
	},
	{
		In: []string{
			"Хабаровский край", "край Хабаровский", "Хабаровском",
		},
		OutCode: "27",
	},
	{
		In: []string{
			"Амурская область", "область Амурская", "Амурской",
		},
		OutCode: "28",
	},
	{
		In: []string{
			"Архангельская область", "область Архангельская", "Архангельской",
		},
		OutCode: "29",
	},
	{
		In: []string{
			"Астраханская область", "область Астраханская", "Астраханской",
		},
		OutCode: "30",
	},
	{
		In: []string{
			"Белгородская область", "область Белгородская", "Белгородской",
		},
		OutCode: "31",
	},
	{
		In: []string{
			"Брянская область", "область Брянская", "Брянской",
		},
		OutCode: "32",
	},
	{
		In: []string{
			"Владимирская область", "область Владимирская", "Владимирской",
		},
		OutCode: "33",
	},
	{
		In: []string{
			"Волгоградская область", "область Волгоградская", "Волгоградской",
		},
		OutCode: "34",
	},
	{
		In: []string{
			"Вологодская область", "область Вологодская", "Вологодской",
		},
		OutCode: "35",
	},
	{
		In: []string{
			"Воронежская область", "область Воронежская", "Воронежской",
		},
		OutCode: "36",
	},
	{
		In: []string{
			"Ивановская область", "область Ивановская", "Ивановской",
		},
		OutCode: "37",
	},
	{
		In: []string{
			"Иркутская область", "область Иркутская", "Иркутской",
		},
		OutCode: "38",
	},
	{
		In: []string{
			"Калининградская область", "область Калининградская", "Калининградской",
		},
		OutCode: "39",
	},
	{
		In: []string{
			"Калужская область", "область Калужская", "Калужской",
		},
		OutCode: "40",
	},
	{
		In: []string{
			"Кемеровская область", "область Кемеровская", "Кемеровской",
		},
		OutCode: "42",
	},
	{
		In: []string{
			"Кировская область", "область Кировская", "Кировской",
		},
		OutCode: "43",
	},
	{
		In: []string{
			"Костромская область", "область Костромская", "Костромской",
		},
		OutCode: "44",
	},
	{
		In: []string{
			"Курганская область", "область Курганская", "Курганской",
		},
		OutCode: "45",
	},
	{
		In: []string{
			"Курская область", "область Курская", "Курской",
		},
		OutCode: "46",
	},
	{
		In: []string{
			"Ленинградская область", "область Ленинградская", "Ленинградской",
		},
		OutCode: "47",
	},
	{
		In: []string{
			"Липецкая область", "область Липецкая", "Липецкой",
		},
		OutCode: "48",
	},
	{
		In: []string{
			"Магаданская область", "область Магаданская", "Магаданской",
		},
		OutCode: "49",
	},
	{
		In: []string{
			"Московская область", "область Московская", "Московской",
		},
		OutCode: "50",
	},
	{
		In: []string{
			"Мурманская область", "область Мурманская", "Мурманской",
		},
		OutCode: "51",
	},
	{
		In: []string{
			"Нижегородская область", "область Нижегородская", "Нижегородской",
		},
		OutCode: "52",
	},
	{
		In: []string{
			"Новгородская область", "область Новгородская", "Новгородской",
		},
		OutCode: "53",
	},
	{
		In: []string{
			"Новосибирская область", "область Новосибирская", "Новосибирской",
		},
		OutCode: "54",
	},
	{
		In: []string{
			"Омская область", "область Омская", "Омской",
		},
		OutCode: "55",
	},
	{
		In: []string{
			"Оренбургская область", "область Оренбургская", "Оренбургской",
		},
		OutCode: "56",
	},
	{
		In: []string{
			"Орловская область", "область Орловская", "Орловской",
		},
		OutCode: "57",
	},
	{
		In: []string{
			"Пензенская область", "область Пензенская", "Пензенской",
		},
		OutCode: "58",
	},
	{
		In: []string{
			"Псковская область", "область Псковская", "Псковской",
		},
		OutCode: "60",
	},
	{
		In: []string{
			"Ростовская область", "область Ростовская", "Ростовской",
		},
		OutCode: "61",
	},
	{
		In: []string{
			"Рязанская область", "область Рязанская", "Рязанской",
		},
		OutCode: "62",
	},
	{
		In: []string{
			"Самарская область", "область Самарская", "Самарской",
		},
		OutCode: "63",
	},
	{
		In: []string{
			"Саратовская область", "область Саратовская", "Саратовской",
		},
		OutCode: "64",
	},
	{
		In: []string{
			"Сахалинская область", "область Сахалинская", "Сахалинской",
		},
		OutCode: "65",
	},
	{
		In: []string{
			"Свердловская область", "область Свердловская", "Свердловской",
		},
		OutCode: "66",
	},
	{
		In: []string{
			"Смоленская область", "область Смоленская", "Смоленской",
		},
		OutCode: "67",
	},
	{
		In: []string{
			"Тамбовская область", "область Тамбовская", "Тамбовской",
		},
		OutCode: "68",
	},
	{
		In: []string{
			"Тверская область", "область Тверская", "Тверской",
		},
		OutCode: "69",
	},
	{
		In: []string{
			"Томская область", "область Томская", "Томской",
		},
		OutCode: "70",
	},
	{
		In: []string{
			"Тульская область", "область Тульская", "Тульской",
		},
		OutCode: "71",
	},
	{
		In: []string{
			"Тюменская область", "область Тюменская", "Тюменской",
		},
		OutCode: "72",
	},
	{
		In: []string{
			"Ульяновская область", "область Ульяновская", "Ульяновской",
		},
		OutCode: "73",
	},
	{
		In: []string{
			"Челябинская область", "область Челябинская", "Челябинской",
		},
		OutCode: "74",
	},
	{
		In: []string{
			"Ярославская область", "область Ярославская", "Ярославской",
		},
		OutCode: "76",
	},
	{
		In: []string{
			"Москва", "москвы", "москве", "москву", "москвой", "москве",
		},
		OutCode: "77",
	},
	{
		In: []string{
			"Санкт-Петербург", "Санкт-Петербурга", "Санкт - Петербургом", "Санкт- Петербурге", "Петербург",
		},
		OutCode: "78",
	},
	{
		In: []string{
			"Севастополь", "Севастополя", "Севастополем",
		},
		OutCode: "92",
	},
	{
		In: []string{
			"Еврейская автономная область", "Еврейской",
		},
		OutCode: "79",
	},
	{
		In: []string{
			"Ненецкий автономный округ", "Ненецком",
		},
		OutCode: "83",
	},
	{
		In: []string{
			"Ханты-Мансийский автономный округ - Югра", "Югра", "Югре", "Ханты-Мансийском",
			"Ханты - Мансийском", "Ханты -Мансийском", "ХМАО",
		},
		OutCode: "86",
	},
	{
		In: []string{
			"Чукотский автономный округ", "Чукотский округ", "Чукотского округа", "округ Чукотский",
		},
		OutCode: "87",
	},
	{
		In: []string{
			"Ямало-Ненецкий автономный округ", "Ямало-Ненецкий округ", "Ямало -Ненецкого",
			"Ямало- Ненецкого", "Ямало - Ненецкого", "ЯНАО",
		},
		OutCode: "89",
	},
}

func TestClient_DefineRegion(t *testing.T) {
	c := NewClient()
	for _, i := range testRegions {
		for _, opt := range i.In {
			r, ok := c.DefineRegion(opt)
			if !ok || r.Code != i.OutCode {
				t.Fatalf("Не определил %s. Входной текст: %s", i.In[0], opt)
			}
		}
	}
	unknown := "неизвестный регион"
	r, ok := c.DefineRegion(unknown)
	if ok || r != nil {
		t.Fatalf("Определил %s. Входной текст: %s", r.Name, unknown)
	}
}

func TestClient_RegionByCode(t *testing.T) {
	c := NewClient()
	valid := []string{
		"1", "02", "21", "77",
	}
	invalid := []string{
		"0", "102", "90", "",
	}
	for _, code := range valid {
		r, ok := c.RegionByCode(code)
		if !ok || r == nil {
			t.Fatalf("Ошибка при поиске по верным кодам регионов. Искали по %s", code)
		}
	}
	for _, code := range invalid {
		r, ok := c.RegionByCode(code)
		if ok || r != nil {
			t.Fatalf("Ошибка при поиске по неверным кодам регионов. Найден по коду %s: %s", code, r.Name)
		}
	}
}
